Res-social/Res-firecracker-set-v1/firecracker_t_10_c_30_readHomeTimeline_composeVcpu_4_wrkVcpu_1/wrk.txt
Running 1m test @ http://nginx-thrift:8080/wrk2-api/home-timeline/read
  10 threads and 30 connections
  Thread calibration: mean lat.: 5272.419ms, rate sampling interval: 18104ms
  Thread calibration: mean lat.: 5186.113ms, rate sampling interval: 18022ms
  Thread calibration: mean lat.: 5209.668ms, rate sampling interval: 18022ms
  Thread calibration: mean lat.: 5245.278ms, rate sampling interval: 18022ms
  Thread calibration: mean lat.: 5228.908ms, rate sampling interval: 18006ms
  Thread calibration: mean lat.: 5229.209ms, rate sampling interval: 18137ms
  Thread calibration: mean lat.: 5252.506ms, rate sampling interval: 18169ms
  Thread calibration: mean lat.: 5220.563ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 5184.927ms, rate sampling interval: 17924ms
  Thread calibration: mean lat.: 5318.464ms, rate sampling interval: 18104ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.91s    14.38s    0.99m    57.77%
    Req/Sec    37.00      0.00    37.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.96s 
 75.000%   47.38s 
 90.000%    0.91m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9969.663     0.000000            2         1.00
   14974.975     0.100000         1877         1.11
   19955.711     0.200000         3755         1.25
   24952.831     0.300000         5633         1.43
   29933.567     0.400000         7506         1.67
   34963.455     0.500000         9387         2.00
   37421.055     0.550000        10316         2.22
   39911.423     0.600000        11256         2.50
   42401.791     0.650000        12193         2.86
   44892.159     0.700000        13131         3.33
   47382.527     0.750000        14070         4.00
   48627.711     0.775000        14540         4.44
   49872.895     0.800000        15009         5.00
   51118.079     0.825000        15477         5.71
   52363.263     0.850000        15946         6.67
   53608.447     0.875000        16420         8.00
   54198.271     0.887500        16646         8.89
   54820.863     0.900000        16883        10.00
   55443.455     0.912500        17119        11.43
   56066.047     0.925000        17355        13.33
   56688.639     0.937500        17587        16.00
   56983.551     0.943750        17702        17.78
   57311.231     0.950000        17824        20.00
   57606.143     0.956250        17936        22.86
   57933.823     0.962500        18062        26.67
   58228.735     0.968750        18170        32.00
   58392.575     0.971875        18235        35.56
   58556.415     0.975000        18295        40.00
   58720.255     0.978125        18358        45.71
   58851.327     0.981250        18405        53.33
   59015.167     0.984375        18469        64.00
   59080.703     0.985938        18493        71.11
   59179.007     0.987500        18529        80.00
   59244.543     0.989062        18555        91.43
   59310.079     0.990625        18581       106.67
   59408.383     0.992188        18617       128.00
   59441.151     0.992969        18630       142.22
   59473.919     0.993750        18643       160.00
   59506.687     0.994531        18653       182.86
   59572.223     0.995313        18680       213.33
   59604.991     0.996094        18693       256.00
   59604.991     0.996484        18693       284.44
   59637.759     0.996875        18705       320.00
   59637.759     0.997266        18705       365.71
   59670.527     0.997656        18716       426.67
   59703.295     0.998047        18729       512.00
   59703.295     0.998242        18729       568.89
   59703.295     0.998437        18729       640.00
   59736.063     0.998633        18742       731.43
   59736.063     0.998828        18742       853.33
   59736.063     0.999023        18742      1024.00
   59736.063     0.999121        18742      1137.78
   59736.063     0.999219        18742      1280.00
   59768.831     0.999316        18753      1462.86
   59768.831     0.999414        18753      1706.67
   59768.831     0.999512        18753      2048.00
   59768.831     0.999561        18753      2275.56
   59768.831     0.999609        18753      2560.00
   59768.831     0.999658        18753      2925.71
   59768.831     0.999707        18753      3413.33
   59768.831     0.999756        18753      4096.00
   59768.831     0.999780        18753      4551.11
   59768.831     0.999805        18753      5120.00
   59768.831     0.999829        18753      5851.43
   59768.831     0.999854        18753      6826.67
   59768.831     0.999878        18753      8192.00
   59768.831     0.999890        18753      9102.22
   59801.599     0.999902        18755     10240.00
   59801.599     1.000000        18755          inf
#[Mean    =    34906.417, StdDeviation   =    14382.016]
#[Max     =    59768.832, Total count    =        18755]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22287 requests in 1.00m, 308.61MB read
  Socket errors: connect 0, read 0, write 0, timeout 399
Requests/sec:    371.37
Transfer/sec:      5.14MB